# IsNormalToleranceSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJExportOptions..::..IsNormalToleranceSet Method
OBJExportOptions Class See Also
---
Checks whether the NormalTolerance tessellation parameter is explicitly set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsNormalToleranceSet()
```

Visual Basic
---
```text
Public Function IsNormalToleranceSet As Boolean
```

Visual C++
---
```text
public:
bool IsNormalToleranceSet()
```

# ### Return Value
True if NormalTolerance tessellation parameter is explicitly set, false otherwise.
# See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace